<?php
/**
 * ${product.title} ${product.version}
 *
 * Файл конфигурации
 *
 * @package Eresus
 *
 * $Id$
 */

/* НЕ ИЗМЕНЯЙТЕ ЭТУ СТРОКУ */
$conf =& Eresus_CMS::getLegacyKernel()->conf;

// Включить или выключить режим отладки. По умолчанию: false
$conf['debug']['enable'] = false;

//-------------------------------------------------------------------------------
//  Настройки источника данных (СУБД)
//-------------------------------------------------------------------------------

// Хост сервера СУБД. По умолчанию: 'localhost'
//$conf['db']['host'] = 'localhost';

// Имя пользователя СУБД
$conf['db']['user'] = '';

// Пароль для доступа к СУБД
$conf['db']['password'] = '';

// Имя базы данных
$conf['db']['name'] = '';

// Префикс таблиц. По умолчанию: '' (без префикса)
//$conf['db']['prefix']   = '';

//-------------------------------------------------------------------------------
//  Региональные настройки
//-------------------------------------------------------------------------------

// Код языка по умолчанию. По умолчанию: 'ru'
//$conf['lang'] = 'ru';

// Временная зона по умолчанию
//$conf['timezone'] = 'Europe/Moscow';

//-------------------------------------------------------------------------------
//  Настройки сессий
//-------------------------------------------------------------------------------

// Тайм-аут сессии в минутах. По умолчанию: 30
//$conf['session']['timeout'] = 30;

//-------------------------------------------------------------------------------
//  Обратная совместимость
//-------------------------------------------------------------------------------

// Этот параметр управляет параметрами обратной совместимости
$conf['backward'] = array(
	// Отключает усиленное хеширование пароля, для совместимости со старыми базами пользователей
	'weak_password' => false,
);

//-------------------------------------------------------------------------------
//  Отладка и ошибки
//-------------------------------------------------------------------------------

// $conf['debug']['mail'] - управление отсылкой почты
// = false       - отключить
// = true        - отправлять как обычно
// = <имя_файла> - записывать в файл

if ($conf['debug']['enable'])
{
	ini_set('display_errors', true);
	error_reporting(E_ALL | E_STRICT);
	$conf['debug']['mail'] = realpath(dirname(__FILE__)).'/../data/.sent';
}
else
{
	ini_set('display_errors', false);
	error_reporting(0);
}
