<?php
/**
 * ${product.title} ${product.version}
 *
 * Файл конфигурации
 *
 * @package Core
 *
 * $Id$
 */

//-------------------------------------------------------------------------------
//  Настройки источника данных (СУБД)
//-------------------------------------------------------------------------------

/*
 * FIXME Задокументировать!
 */
Eresus_Config::set('eresus.cms.dsn', 'mysql://user:password@localhost/database');

/*
 * Использовать префиксы для таблицы БД
 */
//Eresus_Config::set('eresus.cms.dsn.prefix', 'prefix_');

//-------------------------------------------------------------------------------
//  Региональные настройки
//-------------------------------------------------------------------------------

/*
 * Локаль по умолчанию
 */
//Eresus_Config::set('eresus.cms.locale', 'ru_RU');

/*
 * Временная зона по умолчанию
 */
//Eresus_Config::set('eresus.cms.timezone', 'Europe/Moscow');

//-------------------------------------------------------------------------------
//  Настройки сессий
//-------------------------------------------------------------------------------

/*
 * Таймаут сессии в минутах. По умолчанию: 30
 */
//Eresus_Config::set('eresus.cms.session.timeout', 30);

//-------------------------------------------------------------------------------
//  Директории и URL
//-------------------------------------------------------------------------------

/*
 * Корневая директория сайта. Раскомментируйте если Eresus не может определить путь самостоятельно
 */
//Eresus_Config::set('eresus.cms.fs.root', '/usr/home/site.tld/htdocs/');

/*
 * Хост сайта. Раскомментируйте если Eresus не может определить его самостоятельно
 */
//Eresus_Config::set('eresus.cms.http.host', 'example.org');

/*
 * Путь от хоста до корня сайта. Раскомментируйте если Eresus не может определить его самостоятельно
 *
//Eresus_Config::set('eresus.cms.http.root', '/site_path/');

//-------------------------------------------------------------------------------
//  Отладка и ошибки
//-------------------------------------------------------------------------------

// Включить или выключить режим отладки. По умолчанию: false
//Eresus_Config::set('eresus.cms.debug', true);

// Уровень детализации журнала. Возможные значения:
// LOG_EMERG, LOG_ALERT, LOG_ERR, LOG_WARNING, LOG_NOTICE, LOG_INFO, LOG_DEBUG
//Eresus_Config::get('eresus.cms.log.level', LOG_DEBUG);
