<?php
/**
 * ${product.title} ${product.version}
 *
 * Файл конфигурации
 *
 * @package Core
 *
 * $Id$
 */

// Включить или выключить режим отладки. По умолчанию: false
$Eresus->conf['debug']['enable'] = false;

//-------------------------------------------------------------------------------
//  Настройки источника данных (СУБД)
//-------------------------------------------------------------------------------

// FIXME Задокументировать!
Core::setValue('eresus.cms.dsn', 'mysql://user:password@localhost/database');
//Core::setValue('eresus.cms.dsn.prefix', 'prefix_');

//-------------------------------------------------------------------------------
//  Региональные настройки
//-------------------------------------------------------------------------------

// Код языка по умолчанию. По умолчанию: 'ru'
//$Eresus->conf['lang'] = 'ru';

// Временная зона по умолчанмю (для PHP 5.1.0+)
//$Eresus->conf['timezone'] = 'Europe/Moscow';

//-------------------------------------------------------------------------------
//  Настройки сессий
//-------------------------------------------------------------------------------

// Таймаут сессии в минутах. По умолчанию: 30
//$Eresus->conf['session']['timeout'] = 30;

//-------------------------------------------------------------------------------
//  Директории и URL
//-------------------------------------------------------------------------------

// Корневая директория сайта. Раскомментируйте если Eresus не может определить путь самостоятельно
//$Eresus->froot = '/usr/home/site.tld/htdocs/';

// Хост сайта. Раскомментируйте если Eresus не может определить его самостоятельно
//$Eresus->host = 'example.org';

// Путь от хоста до корня сайта. Раскомментируйте если Eresus не может определить его самостоятельно
//$Eresus->path = '/site_path/';

//-------------------------------------------------------------------------------
//  Отладка и ошибки
//-------------------------------------------------------------------------------

// $Eresus->conf['debug']['mail'] - управление отсылкой почты
// = false       - отключить
// = true        - отправлять как обычно
// = <имя_файла> - записывать в файл

if ($Eresus->conf['debug']['enable'])
{
	ini_set('display_errors', true);
	error_reporting(E_ALL);
	$Eresus->conf['debug']['mail'] = realpath(dirname(__FILE__)).'/../data/.sent';
}
else
{
	ini_set('display_errors', false);
	error_reporting(0);
}
