<?php
/**
 * ${product.title} ${product.version}
 *
 * Файл конфигурации
 *
 * @package Core
 *
 * $Id$
 */

// Включить или выключить режим отладки. По умолчанию: false
$Eresus->conf['debug']['enable'] = false;

//-------------------------------------------------------------------------------
//  Настройки источника данных (СУБД)
//-------------------------------------------------------------------------------

// FIXME Задокументировать!
Eresus_Config::set('eresus.cms.dsn', 'mysql://user:password@localhost/database');
//Eresus_Config::set('eresus.cms.dsn.prefix', 'prefix_');

//-------------------------------------------------------------------------------
//  Региональные настройки
//-------------------------------------------------------------------------------

// Локаль по умолчанию.
//Eresus_Config::set('eresus.cms.locale', 'ru_RU');

// Временная зона по умолчанмю (для PHP 5.1.0+)
//$Eresus->conf['timezone'] = 'Europe/Moscow';

//-------------------------------------------------------------------------------
//  Настройки сессий
//-------------------------------------------------------------------------------

// Таймаут сессии в минутах. По умолчанию: 30
//$Eresus->conf['session']['timeout'] = 30;

//-------------------------------------------------------------------------------
//  Директории и URL
//-------------------------------------------------------------------------------

// Корневая директория сайта. Раскомментируйте если Eresus не может определить путь самостоятельно
//$Eresus->froot = '/usr/home/site.tld/htdocs/';

// Хост сайта. Раскомментируйте если Eresus не может определить его самостоятельно
//$Eresus->host = 'example.org';

// Путь от хоста до корня сайта. Раскомментируйте если Eresus не может определить его самостоятельно
//$Eresus->path = '/site_path/';

//-------------------------------------------------------------------------------
//  Отладка и ошибки
//-------------------------------------------------------------------------------

// Уровень детализации журнала. Возможные значения:
// LOG_EMERG, LOG_ALERT, LOG_ERR, LOG_WARNING, LOG_NOTICE, LOG_INFO, LOG_DEBUG
//Eresus_Config::get('eresus.cms.log.level', LOG_DEBUG);
