<?php
/**
 * ${product.title} ${product.version}
 *
 * ${product.description}
 *
 * @copyright 2004, Eresus Project, http://eresus.ru/
 * @license ${license.uri} ${license.name}
 * @author Mikhail Krasilnikov <mihalych@vsepofigu.ru>
 *
 * Данная программа является свободным программным обеспечением. Вы
 * вправе распространять ее и/или модифицировать в соответствии с
 * условиями версии 3 либо (по вашему выбору) с условиями более поздней
 * версии Стандартной Общественной Лицензии GNU, опубликованной Free
 * Software Foundation.
 *
 * Мы распространяем эту программу в надежде на то, что она будет вам
 * полезной, однако НЕ ПРЕДОСТАВЛЯЕМ НА НЕЕ НИКАКИХ ГАРАНТИЙ, в том
 * числе ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ ПРИ ПРОДАЖЕ и ПРИГОДНОСТИ ДЛЯ
 * ИСПОЛЬЗОВАНИЯ В КОНКРЕТНЫХ ЦЕЛЯХ. Для получения более подробной
 * информации ознакомьтесь со Стандартной Общественной Лицензией GNU.
 *
 * Вы должны были получить копию Стандартной Общественной Лицензии
 * GNU с этой программой. Если Вы ее не получили, смотрите документ на
 * <http://www.gnu.org/licenses/>
 *
 * @package l10n
 *
 * $Id$
 */

return array(
	/*
	 * Сообщения
	 */
	'messages' => array(
		/*
		 * Глобальный контекст
		 */
		'global' => array(
			'An error occured in plugin "%s"' =>
				'В модуле "%s" произошла ошибка',
			'Can not find main file "%s" for plugin "%s"' =>
				'Не удалось найти основной файл "%s" для модуля "%s"',
			'Class "%s" not found in plugin file' =>
				'Класс "%" не найден в файле модуля',
			'Configuration' =>
				'Настройки',
			'Controls' =>
				'Управление',
			'Delete' =>
				'Удалить',
			'Disable' =>
				'Отключить',
			'Design' =>
				'Внешний вид',
			'Edit' =>
				'Изменить',
			'Enable' =>
				'Включить',
			'File Manager' =>
				'Файловый менеджер',
			'Plugins' =>
				'Модули расширения',
			'Required kernel of version %s or higher' =>
				'Требуется ядро %s или выше',
			'Site Sections' =>
				'Разделы сайта',
			'Unexpected error! See log for more info.' =>
				'Непредвиденная ошибка! Смотри журнал для подробного описания.',
			'Users' =>
				'Пользователи',
		)
	),
);
