<?php
/**
 * ${product.title}
 *
 * Русские сообщения
 *
 * @version ${product.version}
 * @copyright ${product.copyright}
 * @license ${license.uri} ${license.name}
 * @author Михаил Красильников <mihalych@vsepofigu.ru>
 *
 * Данная программа является свободным программным обеспечением. Вы
 * вправе распространять ее и/или модифицировать в соответствии с
 * условиями версии 3 либо (по вашему выбору) с условиями более поздней
 * версии Стандартной Общественной Лицензии GNU, опубликованной Free
 * Software Foundation.
 *
 * Мы распространяем эту программу в надежде на то, что она будет вам
 * полезной, однако НЕ ПРЕДОСТАВЛЯЕМ НА НЕЕ НИКАКИХ ГАРАНТИЙ, в том
 * числе ГАРАНТИИ ТОВАРНОГО СОСТОЯНИЯ ПРИ ПРОДАЖЕ и ПРИГОДНОСТИ ДЛЯ
 * ИСПОЛЬЗОВАНИЯ В КОНКРЕТНЫХ ЦЕЛЯХ. Для получения более подробной
 * информации ознакомьтесь со Стандартной Общественной Лицензией GNU.
 *
 * Вы должны были получить копию Стандартной Общественной Лицензии
 * GNU с этой программой. Если Вы ее не получили, смотрите документ на
 * <http://www.gnu.org/licenses/>
 *
 * @package Eresus
 *
 * $Id$
 */


return array(
	/*
	 * Сообщения
	 */
	'messages' => array(
		/*
		 * Языковые коды
		 */
		'locale' => array(
			// ISO 639-1
			'en' => 'ru',
		),
		/*
		 * Глобальный контекст
		 */
		'global' => array(
			'Error' => 'Ошибка',
		),
		/*
		 * Вход в панель управления
		 */
		'admin.auth' => array(
		),
		/*
		 * Административный интерфейс
		 */
		'admin' => array(
			'An error occured in module "%s".' => 'В подсистеме "%s" произошла ошибка.',
			'An error occured in plugin "%s".' => 'В расширении "%s" произошла ошибка.',
			'Can not find main file "%s" for plugin "%s"' =>
				'Не удалось найти основной файл "%s" для модуля расширения "%s" ',
			'Change password' => 'Сменить пароль',
			'Content' => 'Наполнение',
			'Eresus %s or higher required.' => 'Требуется Eresus %s или выше.',
			'Exit' => 'Выйти',
			'Plugin "%" not installed or disabled.' =>
				'Модуль расширения "%s" не установлен или отключен.',
			'Requires plugin: %s' => 'Требуется расширение %s',
		),
	),
);
